#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=899ff4df-5513-47d9-9984-159efbad59ad]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0e41cb5-7782-4314-81ee-445364b0753c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a564a503-cd0e-4ecb-ad80-6345c90fefc6]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=59b7ccff-ffa1-45fd-a2c4-a0db7d1cc454]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3ad1d3b0-ee8d-4246-ba21-cd01d2786281]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fedc4b5-1941-4368-8c93-be590b0670f8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0d093c22-ba7c-4d85-94bc-e3430d06f4fe]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=30f18071-66dd-4d05-ab42-ca8ba6098ad0]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3cf62cff-4c51-4df1-9c03-0747d294026c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6f59d5e7-b118-461d-97c7-cbcba6290356]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=655e1e48-72b4-45e4-ad75-0223b0e7021b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3559989c-f390-416f-b178-dde31ae043eb]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e79c1fb-5081-4b53-b637-6b42cec40c12]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f9f98243-d304-4942-9acb-1f529fee9b82]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fc75240d-2577-4ef3-9b83-67a00b42ec3b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=09da8d35-2321-41e1-8426-6537bd712ae7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=802cd761-f519-45cc-97d4-024e3cb7f8b7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c0d6ed1-4c9c-4d2e-b6ec-6cb3bcd69066]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f7e3930-cf59-430e-a675-78cfb092d685]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=893c5928-8dcf-407c-954c-147df4dbbec6]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a049900-08f0-455d-8e60-117d6b1b65e8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3b91fdc2-3e61-4481-b6c9-55f044b76a39]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbc1d716-2a45-459d-86cd-d16b42d6604e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f0c402eb-97b1-4384-9ca3-5330ca3059d1]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a46b9e29-bcfb-45f6-b769-3cf9086a2b81]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=50d10ec2-4cf1-4af7-8c92-91cc5b91259b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=15ff4ea0-70ea-441f-b423-8bd2e53c7fef]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=18510fcb-ee80-41fb-92c3-d157d51ae5bc]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6bc93bd1-34a3-45bb-ba59-0f80457c55d4]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5ba3baf8-c971-484a-bf4a-e652e1fea0f4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=88e90e9e-9922-4a2f-91e1-8448f5df613c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=33b536c5-c7e8-47e1-8ff6-1f09709b32ec]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8594b13a-9c12-4390-94f5-7ba0d0050a91]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83d95a20-8363-4f99-8619-7b3991dba8d8]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=044874c2-6431-48ae-8406-6f7b8458a0e3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1505ede9-97cb-4b02-951e-57b9c006331b]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=57b3f858-b7ef-4126-8e0d-bc5605c0504c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ae454372-19c8-4093-87b5-154ad6f86588]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1262b864-ed54-459b-b135-4cb8286d3554]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ded15d3f-dee9-47bd-b03b-f88dbd574868]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7302304e-4c40-47f9-9da0-bdff8e0553e2]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=07ba0da1-dc37-450a-afb5-daef9551eb7e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a6ae35d9-5d61-4705-ad38-c5136866a1a3]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6f1e226a-a94f-4481-86a5-3459a7628694]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=62986da8-6133-421e-bed4-14cd0bb9f48e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a12d229c-f65f-49f5-b1a0-4bebda10e03c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2871b1e0-719a-41b0-bc7c-a4db1923c469]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ae671e67-97e8-4b38-8f19-df1556cc24eb]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=55bb3928-b97f-4aae-9011-faf5a92d5d7e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=cb52b8da-11cd-4fe7-a4a5-de06310c7e19]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b83ebb29-7401-4cab-9251-875c00611c7d]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b31286d0-02b1-4817-8050-77945247f967]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=22f63304-b712-4d6d-bbdc-69923ea03f83]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4588592c-5cc4-4973-9655-d22d89a4003f]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4bce0ae4-8c9e-43b9-b6a2-81ab80d51283]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f52e2b77-0da6-4e3f-a2ff-6f559c4e6c7c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=827fa47e-a277-4ca1-8f70-32efebfde745]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=abcbe85e-df8c-47ce-a7ab-d2a6a8dfe75e]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=33a4b098-9486-40a2-8616-e1e4071a890a]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=000292c8-5e5c-4d34-a503-488f4cdbb3d6]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96b9351e-8a31-49e0-b9c0-517639e7d236]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0652ce91-1e75-42ce-8966-465816dc9ad9]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3378987d-b723-4617-beec-77a81337de78]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=eeda35f9-0a14-4ba5-bc31-c890c54594ed]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e3e15e97-426b-4cd8-83fe-32cdfc8e37d9]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2bc2550d-5dfa-4f4a-8ad3-5ff736266247]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ed67cd6c-da6a-4f10-8abd-7a8e659811c1]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4de6858a-b6f7-42a2-89c3-69f32bbd077c]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=898c3868-562b-4d56-b837-1121261ba141]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2ee40dce-26eb-4e2f-9e6c-f62a93b551d0]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c410a701-d3c9-424a-b6a8-2c1bf9c5f64e]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=76c2b784-3a1f-402f-8443-979ad265f81a]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4361a63-3caa-4f6c-ace3-919d449fa6ff]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7e47dc2e-8bb4-4946-8eea-db44bfc8ea13]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d17dd5ab-c7e4-4ab9-b50d-433d2ab0db07]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c86dff16-eaa8-40b7-a90d-4eca47a68f48]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=80e8d9cb-ee2e-4d47-8afd-a33691744f9b]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=59cbefeb-ff9c-4125-82c9-e16cfb121a71]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=20145990-6a3b-48d5-8c99-99733194dee5]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=378a7ed3-7a7e-47a8-9ac3-dffd1077d14f]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b58a9e06-30b2-4fd9-a042-8d46d15ce7e3]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4602c64b-fdf5-439d-8dfd-94b2a2d87c5e]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=168fe5fb-b83d-41a3-8bd6-0d3bc997b4fb]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c62521e1-f097-472c-9a75-edc089b7ecb6]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d35dfca4-2753-4423-9a4c-3114febab853]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1bed6e2e-ba8e-435c-994a-dd229a49f9d1]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=da9a081d-f876-4f6d-9ff7-229d5c4a4db7]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=59428ca5-75f7-40d4-bc3a-6c0cd359c321]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1228035e-160a-4059-be47-ad2fdd3f6d2a]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "asdfasdfasdf-4"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "asdfasdfasdf-4"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdfasdfasdf-4.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "asdfasdfasdf-4"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdfasdfasdf-4"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*